![title](./pic/grouping_sorting/grouping/multi_index/1_title.png)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./csv/titanic.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

<br>

---

In allen Beispielen, die wir bisher gesehen haben, haben wir mit `DataFrame`- oder `Series`-Objekten mit einem Single-Label-Index gearbeitet. `.groupby()` ist insofern etwas anders, als dass es je nach der ausgeführten Operation manchmal zu einem so genannten **Multi-Index** führt.

Ein Multi-Index unterscheidet sich von einem normalen Index dadurch, dass er mehrere Ebenen hat. Zum Beispiel:

In [3]:
df_multi = df.groupby(['Sex', 'Age']).Age.count()
df_multi

Sex     Age
female  0.17     1
        0.92     1
        1.00     3
        2.00     1
        3.00     1
                ..
male    61.00    2
        62.00    1
        63.00    1
        64.00    1
        67.00    1
Name: Age, Length: 115, dtype: int64

Mit dem `.loc` Operator und dem ersten Index kannst du dann auf das gewünschte `Series` zugreiffen.

In [4]:
df_multi.loc['male']

Age
0.33     1
0.75     1
0.83     1
2.00     1
5.00     1
        ..
61.00    2
62.00    1
63.00    1
64.00    1
67.00    1
Name: Age, Length: 67, dtype: int64

Willst du aus dem `Series` noch mehr Informationen erhalten und z.B. wissen, wieviele Männer 61 Jahre alt sind, kannst du den zweiten Index auch noch hinzufügen

In [5]:
df_multi.loc['male', 61]

2

In [6]:
df[(df['Age'] == 61) & (df['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
142,1034,0,1,"Ryerson, Mr. Arthur Larned",male,61.0,1,3,PC 17608,262.375,B57 B59 B63 B66,C
193,1085,0,2,"Lingane, Mr. John",male,61.0,0,0,235509,12.350,NaN,Q

<br>

## Übung: Passagiere nach Klasse und Geschlecht sortieren

In [7]:
df_multi = df.groupby(['Pclass', 'Sex']).Sex.count()
df_multi

Pclass  Sex
1       female     50
        male       57
2       female     30
        male       63
3       female     72
        male      146
Name: Sex, dtype: int64

In [8]:
len(df[(df['Pclass'] == 1) & (df['Sex'] == 'female')])

50

In [9]:
df[(df['Pclass'] == 1) & (df['Sex'] == 'female')].PassengerId.count()

50